---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.FromColumn
enum: Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption
source: html/e41f4cbb-e7a9-9481-114d-7c1eb851834b.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalRigidLinksOption.FromColumn

For a structural beam, this indicates that the structural column setting should be used to determine rigid link formation.
 This value is not applicable to structural columns.